#+STARTUP: folded indent inlineimages
#+PROPERTY: header-args:R :results output :exports both :colnames yes
#+PROPERTY: header-args:R+ :session *R:blog*  :width 640 :height 480 :eval never-export
#+OPTIONS: author:nil H:6 toc:nil
#+HUGO_BASE_DIR: ~/Dropbox/repos/github/five-dots/blog
#+HUGO_SECTION: post/2019/11/

#+TITLE: R で米国 ETF パフォーマンス分析
#+DATE: 2019-11-12
#+HUGO_CATEGORIES: finance
#+HUGO_TAGS: r etf
#+HUGO_CUSTOM_FRONT_MATTER: :toc true

米国の ETF について、各資産クラスの代表的な銘柄をリストアップし、主要なパフォーマンス指標をまとめてみたい。データの取得・作図・パフォーマンス指標の計算は、全て R を使って行う。

** Yahoo Finance からダウンロード

={tidyquant}= を利用して [[https://finance.yahoo.com/][Yahoo Finance]] からデータを取得する。 ={tidyquant}= は Tidy な =data.frame= として株価をダウンロードしてくれるので便利だ。

R から Yahoo Finance のデータを読み込む際には、一般的に、[[https://github.com/joshuaulrich/quantmod][ ={quantmod}= ]]が利用されることが多いようだ。しかし ={quantmod}= では、 =xts= でデータが取得されるため ={tidyverse}= のパッケージ群を利用することができない。個人的には、データは =data.frame= (=tibble含む=) に統一しておき ={dplyr}= や ={ggplot2}= などのパッケージの関数を扱えるようにしておいたほうが、快適にデータ分析を進められると思う。

ただし、一部の時系列分析用のパッケージなどでは、入力に =xts= を求めるものがあるので、その場合は都度変換して対処する方針だ。今回も ={PerformanceAnalytics}= を利用する際に =xts= に変換する処理が必要になる。

それでは、先程用意した ETF リストの銘柄の株価を全て取得してみよう。
#+begin_src R :results silent
rawdata <- tq_get(etfs$symbol, from = "1993-01-01")
#+end_src

データは、典型的な四本値 + 分割・配当調整済みの終値 (adjusted) という構成だ。
#+begin_src R :results value
head(rawdata) %>% mutate_if(is.numeric, round, digits = 2)
#+end_src

#+RESULTS:
| symbol |       date |  open |  high |   low | close |  volume | adjusted |
|--------+------------+-------+-------+-------+-------+---------+----------|
| SPY    | 1993-01-29 | 43.97 | 43.97 | 43.75 | 43.94 | 1003200 |    26.58 |
| SPY    | 1993-02-01 | 43.97 | 44.25 | 43.97 | 44.25 |  480500 |    26.77 |
| SPY    | 1993-02-02 | 44.22 | 44.38 | 44.12 | 44.34 |  201300 |    26.83 |
| SPY    | 1993-02-03 | 44.41 | 44.84 | 44.38 | 44.81 |  529400 |    27.11 |
| SPY    | 1993-02-04 | 44.97 | 45.09 | 44.47 |    45 |  531500 |    27.23 |
| SPY    | 1993-02-05 | 44.97 | 45.06 | 44.72 | 44.97 |  492100 |    27.21 |

** データの確認

データの前処理が完了したタイミングで、利用可能期間や =NA= の有無などを確認しておく。
#+begin_src R :results value :colnames yes :rownames yes
data %>%
  group_by(symbol, index) %>%
  summarize(start = min(date), end = max(date), na = sum(is.na(ret)))
#+end_src

#+RESULTS:
|    | symbol | index                         |      start |        end | na |
|----+--------+-------------------------------+------------+------------+----|
|  1 | DIA    | Dow 30                        | 1998-01-21 | 2019-11-12 |  0 |
|  2 | FXB    | GBP                           | 2006-06-27 | 2019-11-12 |  0 |
|  3 | FXE    | EUR                           | 2005-12-13 | 2019-11-12 |  0 |
|  4 | FXF    | CHF                           | 2006-06-27 | 2019-11-12 |  0 |
|  5 | FXY    | JPY                           | 2007-02-14 | 2019-11-12 |  0 |
|  6 | GLD    | Gold                          | 2004-11-19 | 2019-11-12 |  0 |
|  7 | HYG    | High Yield                    | 2007-04-12 | 2019-11-12 |  0 |
|  8 | IEF    | 7-10 Year                     | 2002-07-31 | 2019-11-12 |  0 |
|  9 | IJH    | S&P MidCap 400                | 2000-05-30 | 2019-11-12 |  0 |
| 10 | IJR    | S&P SmallCap 600              | 2000-05-30 | 2019-11-12 |  0 |
| 11 | IWB    | Russel 1000                   | 2000-05-22 | 2019-11-12 |  0 |
| 12 | IWM    | Russel 2000                   | 2000-05-30 | 2019-11-12 |  0 |
| 13 | IYR    | Dow Jones U.S. Real Estate    | 2000-06-20 | 2019-11-12 |  0 |
| 14 | LQD    | Investment Grade              | 2002-07-31 | 2019-11-12 |  0 |
| 15 | PFF    | Preffered Stock               | 2007-04-02 | 2019-11-12 |  0 |
| 16 | QQQ    | NASDAQ 100                    | 1999-03-11 | 2019-11-12 |  0 |
| 17 | SHV    | Short Term                    | 2007-01-12 | 2019-11-12 |  0 |
| 18 | SHY    | 1-3 Year                      | 2002-07-31 | 2019-11-12 |  0 |
| 19 | SLV    | Silver                        | 2006-05-01 | 2019-11-12 |  0 |
| 20 | SPY    | S&P 500                       | 1993-02-01 | 2019-11-12 |  0 |
| 21 | TIP    | Inflation Protected           | 2003-12-08 | 2019-11-12 |  0 |
| 22 | TLT    | 20+ Year                      | 2002-07-31 | 2019-11-12 |  0 |
| 23 | USO    | Crude Oil                     | 2006-04-11 | 2019-11-12 |  0 |
| 24 | UUP    | USD                           | 2007-03-02 | 2019-11-12 |  0 |
| 25 | VXX    | S&P 500 VIX Short-Term Future | 2009-02-02 | 2019-11-12 |  0 |
| 26 | XLB    | Materials                     | 1998-12-23 | 2019-11-12 |  0 |
| 27 | XLE    | Energy                        | 1998-12-23 | 2019-11-12 |  0 |
| 28 | XLF    | Financials                    | 1998-12-23 | 2019-11-12 |  0 |
| 29 | XLI    | Industrial                    | 1998-12-23 | 2019-11-12 |  0 |
| 30 | XLK    | Technology                    | 1998-12-23 | 2019-11-12 |  0 |
| 31 | XLP    | Consumer Staples              | 1998-12-23 | 2019-11-12 |  0 |
| 32 | XLU    | Utilities                     | 1998-12-23 | 2019-11-12 |  0 |
| 33 | XLV    | Health                        | 1998-12-23 | 2019-11-12 |  0 |
| 34 | XLY    | Consumer Discretionary        | 1998-12-23 | 2019-11-12 |  0 |

** パフォーマンス (テーブル)

#+begin_src R
us_sector$perf_table <- calc_perf_metrices(us_sector$data, etfs, benchmark = "SPY")
us_sector$perf_table
#+end_src

#+RESULTS:
#+begin_example
   Symbol                  Index Sharpe    Alpha Beta Avg_Ret Cum_Ret StdDev MaxDD
1     XLV                 Health   0.45  0.00014 0.73    8.1%  407.6%  17.8% 39.2%
2     XLP       Consumer Staples   0.43  0.00012 0.53    6.4%  266.1%  14.9% 35.9%
3     XLY Consumer Discretionary   0.41  0.00012 0.97    9.1%  509.5%  21.8% 59.0%
4     XLI             Industrial   0.39  0.00008 0.96    8.1%  410.5%  20.8% 62.3%
5     XLU              Utilities   0.39  0.00016 0.58    7.3%  330.8%  18.4% 52.3%
6     SPY                S&P 500   0.34  0.00000 1.00    6.5%  274.6%  19.0% 55.2%
7     XLB              Materials   0.32  0.00009 0.96    7.6%  363.1%  23.8% 59.8%
8     XLE                 Energy   0.25  0.00009 0.97    6.7%  288.0%  26.8% 57.4%
9     XLK             Technology   0.24  0.00000 1.14    6.1%  242.8%  25.4% 82.0%
10    XLF             Financials   0.18 -0.00002 1.28    5.5%  207.4%  30.2% 82.7%
#+end_example

** パフォーマンス (テーブル)

#+begin_src R
treasury$perf_table <- calc_perf_metrices(treasury$data, etfs, benchmark = "SPY")
treasury$perf_table
#+end_src

#+RESULTS:
:   Symbol               Index Sharpe   Alpha  Beta Avg_Ret Cum_Ret StdDev MaxDD
: 1    SHV          Short Term   2.72 0.00004  0.00    1.0%   13.8%   0.4%  0.4%
: 2    SHY            1-3 Year   1.42 0.00009 -0.03    1.9%   27.6%   1.4%  2.2%
: 3    IEF           7-10 Year   0.75 0.00026 -0.15    5.0%   87.2%   6.7% 10.4%
: 4    TIP Inflation Protected   0.66 0.00019 -0.07    4.0%   66.2%   6.1% 14.4%
: 5    TLT            20+ Year   0.48 0.00043 -0.32    6.8%  131.6%  14.2% 26.6%
: 6    SPY             S&P 500   0.43 0.00000  1.00    8.4%  181.9%  19.4% 55.2%

** パフォーマンス (テーブル)

#+begin_src R
corp_bond$perf_table <- calc_perf_metrices(corp_bond$data, etfs, benchmark = "SPY")
corp_bond$perf_table
#+end_src

#+RESULTS:
:   Symbol            Index Sharpe   Alpha Beta Avg_Ret Cum_Ret StdDev MaxDD
: 1    LQD Investment Grade   0.69 0.00021 0.04    5.6%   98.5%   8.1% 21.5%
: 2    HYG       High Yield   0.46 0.00008 0.38    5.4%   92.7%  11.6% 34.2%
: 3    SPY          S&P 500   0.43 0.00000 1.00    8.4%  177.2%  19.5% 55.2%
: 4    PFF  Preffered Stock   0.21 0.00002 0.57    4.2%   67.8%  20.2% 65.5%

** パフォーマンス (テーブル)

#+begin_src R
real_estate$perf_table <- calc_perf_metrices(real_estate$data, etfs, benchmark = "SPY")
real_estate$perf_table
#+end_src

#+RESULTS:
:   Symbol                      Index Sharpe   Alpha Beta Avg_Ret Cum_Ret StdDev MaxDD
: 1    IYR Dow Jones U.S. Real Estate   0.36 0.00022 0.98    9.7%  495.9%  26.7% 74.1%
: 2    SPY                    S&P 500   0.31 0.00000 1.00    5.8%  199.8%  18.8% 55.2%

** パフォーマンス (テーブル)

#+begin_src R
commodity$perf_table <- calc_perf_metrices(commodity$data, etfs, benchmark = "SPY")
commodity$perf_table
#+end_src

#+RESULTS:
:   Symbol     Index Sharpe    Alpha Beta Avg_Ret Cum_Ret StdDev MaxDD
: 1    SPY   S&P 500   0.46  0.00000 1.00    8.7%  209.2%  19.0% 55.2%
: 2    GLD      Gold   0.31  0.00028 0.02    5.7%  111.1%  18.4% 45.6%
: 3    SLV    Silver   0.03  0.00010 0.33    1.0%   13.8%  31.2% 72.4%
: 4    USO Crude Oil  -0.36 -0.00058 0.72  -12.3%  -83.0%  33.8% 93.2%

** パフォーマンス (テーブル)

#+begin_src R
volatility$perf_table <- calc_perf_metrices(volatility$data, etfs, benchmark = "SPY")
volatility$perf_table
#+end_src

#+RESULTS:
:   Symbol                         Index Sharpe    Alpha  Beta Avg_Ret Cum_Ret StdDev  MaxDD
: 1    SPY                       S&P 500   0.96  0.00000  1.00   15.3%  363.9%  15.9%  21.8%
: 2    VXX S&P 500 VIX Short-Term Future  -0.88 -0.00047 -3.17  -55.3% -100.0%  62.9% 100.0%

** パフォーマンス (テーブル)

#+begin_src R
forex$perf_table <- calc_perf_metrices(forex$data, etfs, benchmark = "SPY")
forex$perf_table
#+end_src

#+RESULTS:
:   Symbol   Index Sharpe    Alpha  Beta Avg_Ret Cum_Ret StdDev MaxDD
: 1    SPY S&P 500   0.44  0.00000  1.00    8.6%  185.2%  19.4% 55.2%
: 2    FXF     CHF   0.10  0.00008 -0.01    1.2%   16.3%  11.4% 33.4%
: 3    UUP     USD   0.09  0.00008 -0.09    0.8%   10.6%   8.5% 22.2%
: 4    FXY     JPY   0.02  0.00012 -0.22    0.2%    2.3%  10.3% 40.6%
: 5    FXE     EUR  -0.14 -0.00009  0.13   -1.3%  -15.5%   9.7% 35.4%
: 6    FXB     GBP  -0.29 -0.00016  0.14   -2.9%  -31.2%   9.8% 42.1%

